ommoore/STM32EmbeddedDriverDevelopment-MCU1/cortexmx/stm32f446RE_drivers/Src/007spi_message_rcv_it.c
/*
 * This application receives and prints the user message received from the Arduino peripheral in SPI interrupt mode
 * User sends the message through Arduino IDE's serial monitor tool
 * Monitor the message received in the SWV itm data console
 */
/*
 * Note : Follow the instructions to test this code
 * 1. Download this code on to STM32 board , acts as Master
 * 2. Download Slave code (003SPISlaveUartReadOverSPI.ino) on to Arduino board (Slave)
 * 3. Reset both the boards
 * 4. Enable SWV ITM data console to see the message
 * 5. Open Arduino IDE serial monitor tool
 * 6. Type anything and send the message (Make sure that in the serial monitor tool line ending set to carriage return)
 */
#include <stdio.h>
#include <string.h>
#include "stm32f446xx.h"


SPI_Handle_t SPI2handle;

#define MAX_LEN 500

char RcvBuff[MAX_LEN];

volatile char ReadByte;


volatile uint8_t rcvStop = 0;

/*This flag will be set in the interrupt handler of the Arduino interrupt GPIO */
volatile uint8_t dataAvailable = 0;

void delay(void) {

	//this will introduce ~200ms delay when the system clock is 16MHz
	for(uint32_t i = 0; i < 250000; i++);
}

/*
 * PB14 --> SPI2_MISO
 * PB15 --> SPI2_MOSI
 * PB13 -> SPI2_SCLK
 * PB12 --> SPI2_NSS
 * ALT function mode : 5
 */

void SPI2_GPIOInits(void) {

	GPIO_Handle_t SPIPins;

	SPIPins.pGPIOx = GPIOB;
	SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	SPIPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5;
	SPIPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	//NSS
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GPIO_Init(&SPIPins);

	//SCK
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&SPIPins);

	//MISO
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	GPIO_Init(&SPIPins);

	//MOSI
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	GPIO_Init(&SPIPins);
}

void SPI2_Inits(void) {

	SPI2handle.pSPIx = SPI2;
	SPI2handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
	SPI2handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
	SPI2handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV32;
	SPI2handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
	SPI2handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
	SPI2handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
	SPI2handle.SPIConfig.SPI_SSM = SPI_SSM_DI; //Hardware slave management enabled for NSS pin

	SPI_Init(&SPI2handle);
}


/*This function configures the gpio pin (PC4) over which SPI peripheral issues data available interrupt */
void Slave_GPIO_InterruptPinInit(void) {

	GPIO_Handle_t spiIntPin;

	memset(&spiIntPin, 0, sizeof(spiIntPin));

	//LED GPIO configuration
	spiIntPin.pGPIOx = GPIOC;
	spiIntPin.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_4;
	spiIntPin.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN_FT;
	spiIntPin.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
	spiIntPin.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;

	GPIO_Init(&spiIntPin);

	GPIO_IRQPriorityConfig(IRQ_NO_EXTI4, NVIC_IRQ_PRI15);
	GPIO_IRQInterruptConfig(IRQ_NO_EXTI4, ENABLE);
}

/* This function configures the gpio pin (PB3) which acts as SWO to facilitate SWV Trace Output for printf() statement of RcvBuff contents */
//void SWO_GPIO_SWVTraceInit(void) {
//
//	GPIO_Handle_t tracePin;
//
//	memset(&tracePin, 0, sizeof(tracePin));
//
//	//LED GPIO configuration
//	tracePin.pGPIOx = GPIOB;
//	tracePin.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_3;
//	tracePin.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
//	tracePin.GPIO_PinConfig.GPIO_PinAltFunMode = 0;
//	//tracePin.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
//	tracePin.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
//	tracePin.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
//	tracePin.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
//
//	GPIO_Init(&tracePin);
//
//
//}


int main(void) {

	uint8_t dummy = 0xFF;

	Slave_GPIO_InterruptPinInit();

	//this function is used to initialize the GPIO pins to behave as SPI2 pins
	SPI2_GPIOInits();

	//This function is used to initialize the SPI2 peripheral parameters
	SPI2_Inits();

	/*
	* making SSOE 1 does NSS output enable.
	* The NSS pin is automatically managed by the hardware.
	* i.e when SPE=1 , NSS will be pulled to low
	* and NSS pin will be high when SPE=0
	*/
	SPI_SSOEConfig(SPI2, ENABLE);

	SPI_IRQInterruptConfig(IRQ_NO_SPI2, ENABLE);

	while(1){

		rcvStop = 0;

		while(!dataAvailable); //wait till data available interrupt from transmitter device(slave)

		GPIO_IRQInterruptConfig(IRQ_NO_EXTI4, DISABLE);

		//enable the SPI2 peripheral
		SPI_PeripheralControl(SPI2, ENABLE);

		while(!rcvStop) {
			/* fetch the data from the SPI peripheral byte by byte in interrupt mode */
			while(SPI_SendDataIT(&SPI2handle, &dummy, 1) == SPI_BUSY_IN_TX);
			while(SPI_ReceiveDataIT(&SPI2handle, (uint8_t*)&ReadByte, 1) == SPI_BUSY_IN_RX);
		}

		// confirm SPI is not busy
		while(SPI_GetFlagStatus(SPI2, SPI_FLAG_BUSY));

		//Disable the SPI2 peripheral
		SPI_PeripheralControl(SPI2, DISABLE);

		printf("Rcvd data = %s\n", RcvBuff);

		dataAvailable = 0;

		GPIO_IRQInterruptConfig(IRQ_NO_EXTI4, ENABLE);
	}

	return 0;
}


/* Runs when a data byte is received from the peripheral over SPI*/
void SPI2_IRQHandler(void) {

	SPI_IRQHandling(&SPI2handle);
}

void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle, uint8_t AppEv) {

	static uint32_t i = 0;

	/* In the RX complete event , copy data in to rcv buffer . '\0' indicates end of message(rcvStop = 1) */
	if(AppEv == SPI_EVENT_RX_CMPLT) {

		RcvBuff[i++] = ReadByte;

		if(ReadByte == '\0' || (i == MAX_LEN)) {

			rcvStop = 1;
			RcvBuff[i-1] = '\0';
			i = 0;
		}
	}
}

/* Slave data available interrupt handler */
void EXTI4_IRQHandler(void) {

	GPIO_IRQHandling(GPIO_PIN_NO_4);
	dataAvailable = 1;
}
